; domain
(define (domain myDomain)
    (:predicates (packaging)(assemble)(delivered)
        (have-sprinkle)(have-chocolate)(have-vanilla)(have-cone)(have-order)
        (sprinkle ?x)(chocolate ?x)(vanilla ?x)(cone ?x)(order ?x))
 
    (:action packaging
        :parameters ()
	    :precondition (assemble) ;; if ice-cream is assembled then we will package them
        :effect (and (packaging)
                (not (delivered)))) ;; still not delivered

    (:action delivery
        :parameters ()
        :precondition (and(not (delivered)) ;; if packaging is completed and not delevered yet
                      (packaging))
        :effect (delivered))

    (:action add-sprinkle
        :parameters (?x)
        :precondition (sprinkle ?x)
        :effect (have-sprinkle))
    
    (:action add-chocolate
        :parameters (?x)
        :precondition (chocolate ?x)
        :effect (have-chocolate))

    (:action add-vanilla
        :parameters (?x)
        :precondition (vanilla ?x)
        :effect (have-vanilla))
  
    (:action add-cone
        :parameters (?x)
        :precondition (cone ?x)
        :effect (have-cone))
    (:action order
        :parameters (?x)
        :precondition (order ?x)
        :effect (have-order))
  
)

; problem
(define 
(problem Ice_Cream_Factory)
(:domain myDomain)
(:objects ShopOrder WhiteChocolate Vanilla ThinCone littleSprinkle)
(:init  (order ShopOrder)
        (chocolate WhiteChocolate)
        (vanilla Vanilla)
        (cone ThinCone)
        (sprinkle littleSprinkle)
        (assemble))
(:goal (and (have-order)
        (have-cone)
        (have-chocolate)
        (have-vanilla)
        (have-sprinkle)
        (packaging)
        (delivered))))

; plan
1. (order shoporder)
   added: (have-order)
   goals met: 1 of 7
2. (add-cone thincone)
   added: (have-cone)
   goals met: 2 of 7
3. (add-vanilla vanilla)
   added: (have-vanilla)
   goals met: 3 of 7
4. (add-chocolate whitechocolate)
   added: (have-chocolate)
   goals met: 4 of 7
5. (add-sprinkle littlesprinkle)
   added: (have-sprinkle)
   goals met: 5 of 7
6. (packaging)
   added: (packaging)
   goals met: 6 of 7
7. (delivery)
   added: (delivered)
   goals met: 7 of 7
